АвтосервисАвтомагазин/src/Catalogs/КА2_Поколения/КА2_Поколения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>КА2_Поколения</name>
  <owners>Catalog.КА2_Модели</owners>
  <attributes>
    <name>id_car_model</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>11</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>year_begin</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>year_end</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>date_create</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>date_update</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>id_car_type</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>8</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>bodycars</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>256</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

АвтосервисАвтомагазин/src/Catalogs/КА2_Модели/КА2_Модели.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>КА2_Модели</name>
  <owners>Catalog.КА2_НаименованияМоделей</owners>
  <attributes>
    <name>id_car_mark</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>8</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>name_rus</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>date_create</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>date_update</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>id_car_type</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>8</precision>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

АвтосервисАвтомагазин/src/Catalogs/КА2_Поколения/ObjectModule.bsl
// 
//	Аутсорсинг Групп 
//		+7 495 241 10 64
//		+7 3852 59 50 96
//		
//	Филимонов И.В.
//		+7 913 240 81 77
//
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)

	ТипДанныхЗаполнения = ТипЗнч(ДанныеЗаполнения);

	Если ТипДанныхЗаполнения = Тип("Структура") Тогда

		ДанныеЗаполнения.Свойство("Код", Код);
		ДанныеЗаполнения.Свойство("Наименование", Наименование);
		ДанныеЗаполнения.Свойство("year_begin", year_begin);
		ДанныеЗаполнения.Свойство("year_end", year_end);
		ДанныеЗаполнения.Свойство("id_car_model", id_car_model);
		ДанныеЗаполнения.Свойство("id_car_type", id_car_type);
		ДанныеЗаполнения.Свойство("date_create", date_create);
		ДанныеЗаполнения.Свойство("date_update", date_update);

	КонецЕсли;

КонецПроцедуры

Процедура ПередЗаписью(Отказ)

	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

	Владелец = Справочники.КА2_Модели.НайтиПоКоду(id_car_model);

КонецПроцедуры
#КонецОбласти

#КонецЕсли
